#include "fchmod.h"

#include <windows.h>
#include <tchar.h>
#include <stdio.h>
#include <io.h>
#include <wchar.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <errno.h>
#include <stddef.h>
//#include <winternl.h>

// NT structures are undefined outside NT DDKs
typedef enum _OBJECT_INFORMATION_CLASS {
    ObjectBasicInformation,
    ObjectNameInformation,
    ObjectTypeInformation,
    ObjectAllInformation,
    ObjectDataInformation
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _OBJECT_INFORMATION_CLASS FAR* LPOBJECT_INFORMATION_CLASS;

typedef struct _UNICODE_STRING {
  USHORT Length;
  USHORT MaximumLength;
  PWSTR  Buffer;
} UNICODE_STRING, *PUNICODE_STRING;

typedef struct _UNICODE_STRING FAR * LPUNICODE_STRING;

typedef struct _PUBLIC_OBJECT_BASIC_INFORMATION {
    ULONG Attributes;
    ACCESS_MASK GrantedAccess;
    ULONG HandleCount;
    ULONG PointerCount;
    ULONG Reserved[10];    // reserved for internal use
 } PUBLIC_OBJECT_BASIC_INFORMATION, *PPUBLIC_OBJECT_BASIC_INFORMATION;

typedef struct _PUBLIC_OBJECT_BASIC_INFORMATION FAR *LPPUBLIC_OBJECT_BASIC_INFORMATION;

typedef struct __PUBLIC_OBJECT_TYPE_INFORMATION {
    UNICODE_STRING TypeName;
    ULONG Reserved [22];    // reserved for internal use
} PUBLIC_OBJECT_TYPE_INFORMATION, *PPUBLIC_OBJECT_TYPE_INFORMATION;

typedef struct __PUBLIC_OBJECT_TYPE_INFORMATION FAR *LPPUBLIC_OBJECT_TYPE_INFORMATION;

typedef struct _OBJECT_NAME_INFORMATION {
    UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION;

typedef struct _OBJECT_NAME_INFORMATION FAR *LPOBJECT_NAME_INFORMATION;

// NSTATUS codes are undefined outside NT DDKs
#ifndef STATUS_SUCCESS
#define STATUS_SUCCESS                   ((NTSTATUS) 0x00000000)
#endif

#ifndef STATUS_BUFFER_OVERFLOW
#define STATUS_BUFFER_OVERFLOW           ((NTSTATUS) 0x80000005)
#endif

#ifndef STATUS_INFO_LENGTH_MISMATCH
#define STATUS_INFO_LENGTH_MISMATCH      ((NTSTATUS) 0xC0000004)
#endif

#ifndef MIN
#define MIN(A, B) (((A) < (B)) ? (A) : (B))
#endif

#define NAKED __declspec(naked)

#define GetVxDServiceOrdinal(service)   service

#define VxDCall(service) \
    _asm _emit 0xcd \
    _asm _emit 0x20 \
    _asm _emit (GetVxDServiceOrdinal(service) & 0xff) \
    _asm _emit (GetVxDServiceOrdinal(service) >> 8) & 0xff \
    _asm _emit (GetVxDServiceOrdinal(service) >> 16) & 0xff \
    _asm _emit (GetVxDServiceOrdinal(service) >> 24) & 0xff \

#define VxDJmp(service) \
    _asm _emit 0xcd \
    _asm _emit 0x20 \
    _asm _emit (GetVxDServiceOrdinal(service) & 0xff) \
    _asm _emit ((GetVxDServiceOrdinal(service) >> 8) & 0xff) | 0x80 \
    _asm _emit (GetVxDServiceOrdinal(service) >> 16) & 0xff \
    _asm _emit (GetVxDServiceOrdinal(service) >> 24) & 0xff \

#ifndef MAKEDWORD
#define MAKEDWORD(a, b)      ((DWORD)(((WORD)(a)) | ((DWORD)((WORD)(b))) << 16))
#endif

#ifndef VOLUME_NAME_DOS
#define VOLUME_NAME_DOS 0x0
#endif

#ifndef VOLUME_NAME_GUID
#define VOLUME_NAME_GUID 0x1
#endif

#ifndef VOLUME_NAME_NONE
#define VOLUME_NAME_NONE 0x4
#endif

#ifndef VOLUME_NAME_NT
#define VOLUME_NAME_NT 0x2
#endif

#ifndef FILE_NAME_NORMALIZED
#define FILE_NAME_NORMALIZED 0x0
#endif

#ifndef FILE_NAME_OPENED
#define FILE_NAME_OPENED 0x8
#endif

// CompareString and CompareStringW are undefined on NT 3.1
#ifndef CompareString
	#ifdef  UNICODE
		#define CompareString CompareStringW
	#else   /* UNICODE */
		#define CompareString CompareStringA
	#endif /* UNICODE */
	static inline int CompareStringA(LCID lcid, DWORD fdwStyle, LPCSTR lpString1, int cch1, LPCSTR lpString2, int cch2)
	{
		int lpString1Len = ((lpString1 == NULL) ? 0 : lstrlen(lpString1));
		int lpString2Len = ((lpString2 == NULL) ? 0 : lstrlen(lpString2));

		int cch1BufLength;
		int cch2BufLength;

		int i;
		int ret;

		LPWSTR string1;
		LPWSTR string2;

		if(cch1 < 0)
		{
			cch1BufLength = lpString1Len;
		}
		else
		{
			cch1BufLength = MIN(lpString1Len + 1, cch1);
		}

		if(cch2 < 0)
		{
			cch2BufLength = lpString2Len;
		}
		else
		{
			cch2BufLength = MIN(lpString2Len + 1, cch2);
		}

		string1 = (LPWSTR)LocalAlloc(LPTR, cch1BufLength * sizeof (WCHAR));

		if(string1 == NULL)
		{
			return 0;
		}

		string2 = (LPWSTR)LocalAlloc(LPTR, cch2BufLength * sizeof (WCHAR));

		if(string2 == NULL)
		{
			DWORD err = GetLastError();
			LocalFree(string1);
			SetLastError(err);

			return 0;
		}

		for(i = 0; i < cch1BufLength; i++)
		{
			string1[i] = lpString1[i];
		}

		for(i = 0; i < cch2BufLength; i++)
		{
			string2[i] = lpString2[i];
		}

		ret = CompareStringW(lcid, fdwStyle, string1, cch1, string2, cch2);

		LocalFree(string1);
		LocalFree(string2);

		return ret;
	}
#endif

// CSTR_EQUAL is undefined in NT 3.1 SDK
#ifndef CSTR_EQUAL
#define CSTR_EQUAL 2
#endif

typedef LONG NTSTATUS;

typedef struct _LOSVERSIONINFOEXW {
  DWORD dwOSVersionInfoSize;
  DWORD dwMajorVersion;
  DWORD dwMinorVersion;
  DWORD dwBuildNumber;
  DWORD dwPlatformId;
  WCHAR szCSDVersion[128];
  WORD  wServicePackMajor;
  WORD  wServicePackMinor;
  WORD  wSuiteMask;
  BYTE  wProductType;
  BYTE  wReserved;
} LOSVERSIONINFOEXW;

typedef struct _LOSVERSIONINFOEXA {
  DWORD dwOSVersionInfoSize;
  DWORD dwMajorVersion;
  DWORD dwMinorVersion;
  DWORD dwBuildNumber;
  DWORD dwPlatformId;
  CHAR  szCSDVersion[128];
  WORD  wServicePackMajor;
  WORD  wServicePackMinor;
  WORD  wSuiteMask;
  BYTE  wProductType;
  BYTE  wReserved;
} LOSVERSIONINFOEXA;

typedef struct _LOSVERSIONINFOA {
  DWORD dwOSVersionInfoSize;
  DWORD dwMajorVersion;
  DWORD dwMinorVersion;
  DWORD dwBuildNumber;
  DWORD dwPlatformId;
  CHAR  szCSDVersion[128];
} LOSVERSIONINFOA;

typedef struct _LOSVERSIONINFOW {
  DWORD dwOSVersionInfoSize;
  DWORD dwMajorVersion;
  DWORD dwMinorVersion;
  DWORD dwBuildNumber;
  DWORD dwPlatformId;
  WCHAR szCSDVersion[128];
} LOSVERSIONINFOW;

typedef LOSVERSIONINFOEXA *PLOSVERSIONINFOEXA;
typedef LOSVERSIONINFOEXA FAR * LPLOSVERSIONINFOEXA;

typedef LOSVERSIONINFOEXW LRTL_OSVERSIONINFOEXW;
typedef LOSVERSIONINFOEXW *PLOSVERSIONINFOEXW;
typedef LOSVERSIONINFOEXW *PLRTL_OSVERSIONINFOEXW;

typedef LOSVERSIONINFOEXW FAR * LPLOSVERSIONINFOEXW;
typedef LOSVERSIONINFOEXW FAR * LPLRTL_OSVERSIONINFOEXW;

typedef LOSVERSIONINFOA * PLOSVERSIONINFOA;
typedef LOSVERSIONINFOA FAR * LPLOSVERSIONINFOA;

typedef LOSVERSIONINFOW LRTL_OSVERSIONINFOW;
typedef LOSVERSIONINFOW * PLOSVERSIONINFOW;
typedef LOSVERSIONINFOW *PLRTL_OSVERSIONINFOW;

typedef LOSVERSIONINFOW FAR * LPLOSVERSIONINFOW;
typedef LOSVERSIONINFOW FAR * LPLRTL_OSVERSIONINFOW;

#pragma pack(1) 

typedef struct _MODREF 
{ 
    struct _MODREF *pNextModRef;    // 00h 
    DWORD           un1;            // 04h 
    DWORD           un2;            // 08h 
    DWORD           un3;            // 0Ch 
    WORD            mteIndex;       // 10h 
    WORD            un4;            // 12h 
    DWORD           un5;            // 14h 
    PVOID           ppdb;           // 18h Pointer to process database 
    DWORD           un6;            // 1Ch 
    DWORD           un7;            // 20h 
    DWORD           un8;            // 24h 
} MODREF, *PMODREF; 
 
typedef struct _IMTE 
{ 
    DWORD           un1;            // 00h 
    PIMAGE_NT_HEADERS   pNTHdr;     // 04h 
    DWORD           un2;            // 08h 
    PSTR            pszFileName;    // 0Ch 
    PSTR            pszModName;     // 10h 
    WORD            cbFileName;     // 14h 
    WORD            cbModName;      // 16h 
    DWORD           un3;            // 18h 
    DWORD           cSections;      // 1Ch 
    DWORD           un5;            // 20h 
    DWORD           baseAddress;    // 24h 
    WORD            hModule16;      // 28h 
    WORD            cUsage;         // 2Ah 
    DWORD           un7;            // 2Ch 
    PSTR            pszFileName2;   // 30h 
    WORD            cbFileName2;    // 34h 
    DWORD           pszModName2;    // 36h 
    WORD            cbModName2;     // 3Ah 
} IMTE, *PIMTE; 
 
typedef struct _ENVIRONMENT_DATABASE 
{ 
PSTR    pszEnvironment;     // 00h Pointer to Environment 
DWORD   un1;                // 04h 
PSTR    pszCmdLine;         // 08h Pointer to command line 
PSTR    pszCurrDirectory;   // 0Ch Pointer to current directory 
LPSTARTUPINFOA pStartupInfo;// 10h Pointer to STARTUPINFOA struct 
HANDLE  hStdIn;             // 14h Standard Input 
HANDLE  hStdOut;            // 18h Standard Output 
HANDLE  hStdErr;            // 1Ch Standard Error 
DWORD   un2;                // 20h 
DWORD   InheritConsole;     // 24h 
DWORD   BreakType;          // 28h 
DWORD   BreakSem;           // 2Ch 
DWORD   BreakEvent;         // 30h 
DWORD   BreakThreadID;      // 34h 
DWORD   BreakHandlers;      // 38h 
} ENVIRONMENT_DATABASE, EDB, *PENVIRONMENT_DATABASE, *PEDB; 
 
typedef struct _HANDLE_TABLE_ENTRY 
{ 
    DWORD   flags;      // Valid flags depend on what type of object this is 
    PVOID   pObject;    // Pointer to the object that the handle refers to 
} HANDLE_TABLE_ENTRY, *PHANDLE_TABLE_ENTRY; 
 
typedef struct _HANDLE_TABLE 
{ 
    DWORD   cEntries;               // Max number of handles in table 
    HANDLE_TABLE_ENTRY array[1];    // An array (number is given by cEntries) 
} HANDLE_TABLE, *PHANDLE_TABLE; 
 
typedef struct _PDB95 {                 // Size = 0xC0 (from Kernel32) 
    DWORD   Type;                       //00 KERNEL32 object type (K32OBJ_PROCESS = 5) 
    DWORD   cReference;                 //04 Number of references to process 
    DWORD   Unknown1;                   //08 (always 0) 
    DWORD   pEvent;                     //0C Pointer to K32OBJ_EVENT (2) 
    DWORD   TerminationStatus;          //10 Returned by GetExitCodeProcess() 
    DWORD   Unknown2;                   //14 (always 0) 
    DWORD   DefaultHeap;                //18 Address of the default process heap 
    DWORD   MemoryContext;              //1C Pointer to the process's context (Returned by GetProcessHeap()) 
    DWORD   Flags;                      //20 Flags 
    DWORD   pPSP;                       //24 Linear address of PSP ? 
    WORD    PSPSelector;                //28 Selector for DOS PSP 
    WORD    MTEIndex;                   //2A *4 + ModuleList = IMTE 
    WORD    cThreads;                   //2C Number of threads belonging to this process 
    WORD    cNotTermThreads;            //2E Number of threads for this process that haven't yet been terminated 
    WORD    Unknown3;                   //30 (always 0) 
    WORD    cRing0Threads;              //32 Number of ring 0 threads 
    HANDLE  HeapHandle;                 //34 Heap to allocate handle tables out of (this seems to always be the KERNEL32 heap) 
    HTASK   W16TDB;                     //38 Win16 Task Database selector 
    DWORD   MemMapFiles;                //3C Pointer to memory mapped file list 
    PEDB    pEDB;                       //40 Pointer to Environment Database 
    PHANDLE_TABLE pHandleTable;         //44 Pointer to process handle table 
    struct _PDB95* ParentPDB;            //48 Parent process database 
    PMODREF MODREFlist;                 //4C Pointer to module reference list 
    DWORD   ThreadList;                 //50 Pointer to list of threads owned by this process 
    DWORD   DebuggeeCB;                 //54 Debuggee Context block ? 
    DWORD   LocalHeapFreeHead;          //58 Pointer to head of free list in process heap 
    DWORD   InitialRing0ID;             //5C (always 0) 
    CRITICAL_SECTION CriticalSection;   //60 Defined in winnt.h (len=0x18) 
    DWORD   Unknow4[2];                 //78 (always 0) 
    DWORD   pConsole;                   //80 Pointer to console object for process (K32OBJ_CONSOLE = 9) 
    DWORD   tlsInUseBits1;              //84 Represents TLS status bits 0 - 31 
    DWORD   tlsInUseBits2;              //88 Represents TLS status bits 32 - 63 
    DWORD   ProcessDWORD;               //8C Retrieved by GetProcessDword() 
    struct _PDB95* ProcessGroup;         //90 Pointer to the master process (K32_OBJ_PROCESS = 5) 
    DWORD   pExeMODREF;                 //94 Pointer to EXE's MODREF 
    DWORD   TopExcFilter;               //98 Top Exception Filter 
    DWORD   PriorityClass;              //9C Base scheduling priority for process (8 = NORMAL) 
    DWORD   HeapList;                   //A0 Head of the list of process heaps 
    DWORD   HeapHandleList;             //A4 Pointer to head of heap handle block list 
    DWORD   HeapPointer;                //A8 Normally zero, but can pointer to a moveable handle block in the heap 
    DWORD   pConsoleProvider;           //AC Zero or process that owns the console we're using (K32OBJ_CONSOLE) 
    WORD    EnvironSelector;            //B0 Selector containing process environment 
    WORD    ErrorMode;                  //B2 Value set by SetErrorMode() 
    DWORD   pEventLoadFinished;         //B4 Pointer to event LoadFinished (K32OBJ_EVENT = 2) 
    WORD    UTState;                    //B8 
    DWORD   Unknown5[2];                //BA 
} PDB95, *PPDB95; 

typedef struct _PDB98 {                 // Size = 0xC4 (from Kernel32) 
    BYTE    Type;                       // 00 Kernel object type = K32OBJ_PROCESS (6) 
    BYTE    Unknown_A;                  // 01 (align ?) 
    WORD    cReference;                 // 02 Number of references to process 
    DWORD   Unknown_B;                  // 04 Pointer to ??? 
    DWORD   Unknown1;                   // 08 (zero) 
    DWORD   pEvent;                     // 0C Event for process waiting 
    DWORD   TerminationStatus;          // 10 GetExitCodeProcess 
    DWORD   Unknown2;                   // 14 May be used for private purposes 
    DWORD   DefaultHeap;                // 18 GetProcessHeap 
    DWORD   MemoryContext;              // 1C Pointer to process context 
    DWORD   Flags;                      // 20 Flags 
    DWORD   pPSP;                       // 24 Linear address of DOS PSP 
    WORD    PSPSelector;                // 28 Selector to DOS PSP 
    WORD    MTEIndex;                   // 2A Index into global module table 
    WORD    cThreads;                   // 2C Threads.ItemCount 
    WORD    cNotTermThreads;            // 2E Threads.ItemCount 
    WORD    Unknown3;                   // 30 (zero) 
    WORD    cRing0Threads;              // 32 Normally Threads.ItemCount (except kernel32) 
    HANDLE  HeapHandle;                 // 34 Kernel32 shared heap 
    DWORD   w16TDB;                     // 38 Win16 task database selector 
    DWORD   MemMappedFiles;             // 3C List of memory mapped files 
    PEDB    pEDB;                       // 40 Pointer to Environment Database 
    PHANDLE_TABLE pHandleTable;         // 44 Pointer to Handle Table 
    struct _PDB98* ParentPDB;            // 48 Pointer to parent process (PDB) 
    PMODREF MODREFList;                 // 4C Pointer to list of modules 
    DWORD   ThreadList;                 // 50 Pointer to list of threads 
    DWORD   DebuggeeCB;                 // 54 Debuggee context block 
    DWORD   LocalHeapFreeHead;          // 58 Free list for process default heap 
    DWORD   InitialRing0ID;             // 5C Meaning unknown 
    CRITICAL_SECTION CriticalSection;   // 60 For synchronizing threads 
    DWORD   Unknown4[3];                // 78 
    DWORD   pConsole;                   // 84 Output console 
    DWORD   tlsInUseBits1;              // 88 Status of TLS indexes  0 - 31 
    DWORD   tlsInUseBits2;              // 8C Status of TLS indexes 32 - 63 
    DWORD   ProcessDWORD;               // 90 Undocumented API GetProcessDword, meaning unknown 
    struct _PDB98* ProcessGroup;         // 94 Master process PDB (in debugging) 
    DWORD   pExeMODREF;                 // 98 Points to exe's module structure 
    DWORD   TopExcFilter;               // 9C SetUnhandledExceptionFilter 
    DWORD   PriorityClass;              // A0 PriorityClass (8 = NORMAL) 
    DWORD   HeapList;                   // A4 List of heaps 
    DWORD   HeapHandleList;             // A8 List of moveable memory blocks 
    DWORD   HeapPointer;                // AC Pointer to one moveable memory block, meaning unknown 
    DWORD   pConsoleProvider;           // B0 Console for DOS apps 
    WORD    EnvironSelector;            // B4 Environment database selector 
    WORD    ErrorMode;                  // B6 SetErrorMode 
    DWORD   pEventLoadFinished;         // B8 Signaled when the process has finished loading 
    WORD    UTState;                    // BC Universal thunking, meaning unknown 
    WORD    Unknown5;                   // BE (zero) 
    DWORD   Unknown6;                   // C0 
} PDB98, *PPDB98; 

typedef struct _PDBME {                 // Size = 0xC4 (from Kernel32) 
    BYTE    Type;                       // 00 Kernel object type = K32OBJ_PROCESS (6) 
    BYTE    Unknown_A;                  // 01 (align ?) 
    WORD    cReference;                 // 02 Number of references to process 
    DWORD   Unknown_B;                  // 04 Pointer to ??? 
    DWORD   Unknown1;                   // 08 (zero) 
    DWORD   pEvent;                     // 0C Event for process waiting 
    DWORD   TerminationStatus;          // 10 GetExitCodeProcess 
    DWORD   Unknown2;                   // 14 May be used for private purposes 
    DWORD   DefaultHeap;                // 18 GetProcessHeap 
    DWORD   MemoryContext;              // 1C Pointer to process context 
    DWORD   Flags;                      // 20 Flags 
    DWORD   pPSP;                       // 24 Linear address of DOS PSP 
    WORD    PSPSelector;                // 28 Selector to DOS PSP 
    WORD    MTEIndex;                   // 2A Index into global module table 
    WORD    cThreads;                   // 2C Threads.ItemCount 
    WORD    cNotTermThreads;            // 2E Threads.ItemCount 
    WORD    Unknown3;                   // 30 (zero) 
    WORD    cRing0Threads;              // 32 Normally Threads.ItemCount (except kernel32) 
    HANDLE  HeapHandle;                 // 34 Kernel32 shared heap 
    DWORD   w16TDB;                     // 38 Win16 task database selector 
    DWORD   MemMappedFiles;             // 3C List of memory mapped files 
    PEDB    pEDB;                       // 40 Pointer to Environment Database 
    PHANDLE_TABLE pHandleTable;         // 44 Pointer to Handle Table 
    struct _PDBME* ParentPDB;            // 48 Pointer to parent process (PDB) 
    PMODREF MODREFList;                 // 4C Pointer to list of modules 
    DWORD   ThreadList;                 // 50 Pointer to list of threads 
    DWORD   DebuggeeCB;                 // 54 Debuggee context block 
    DWORD   LocalHeapFreeHead;          // 58 Free list for process default heap 
    DWORD   InitialRing0ID;             // 5C Meaning unknown 
    CRITICAL_SECTION CriticalSection;   // 60 For synchronizing threads 
    DWORD   Unknown4[2];                // 78 
    DWORD   pConsole;                   // 80 Output console 
    DWORD   tlsInUseBits1;              // 84 Status of TLS indexes  0 - 31 
    DWORD   tlsInUseBits2;              // 88 Status of TLS indexes 32 - 63 
    DWORD   ProcessDWORD;               // 8C Undocumented API GetProcessDword, meaning unknown 
    DWORD   Unknown_C;                  // 90 Unknown 
    struct _PDBME* ProcessGroup;         // 94 Master process PDB (in debugging) 
    DWORD   pExeMODREF;                 // 98 Points to exe's module structure 
    DWORD   TopExcFilter;               // 9C SetUnhandledExceptionFilter 
    DWORD   PriorityClass;              // A0 PriorityClass (8 = NORMAL) 
    DWORD   HeapList;                   // A4 List of heaps 
    DWORD   HeapHandleList;             // A8 List of moveable memory blocks 
    DWORD   HeapPointer;                // AC Pointer to one moveable memory block, meaning unknown 
    DWORD   pConsoleProvider;           // B0 Console for DOS apps 
    WORD    EnvironSelector;            // B4 Environment database selector 
    WORD    ErrorMode;                  // B6 SetErrorMode 
    DWORD   pEventLoadFinished;         // B8 Signaled when the process has finished loading 
    WORD    UTState;                    // BC Universal thunking, meaning unknown 
    WORD    Unknown5;                   // BE (zero) 
    DWORD   Unknown6;                   // C0 
} PDBME, *PPDBME; 
 
typedef union _PROCESS_DATABASE {
	PDB95 pdb95;
	PDB98 pdb98;
	PDBME pdbME;
} PROCESS_DATABASE, *PPROCESS_DATABASE;

struct _TDB95;
struct _TDB98;
struct _TDBME;

typedef struct _TDBX95 { 
    struct _TDB98  *ptdb;             // 00 TDB 
    PDB98  *ppdb;             // 04 PDB 
    DWORD  ContextHandle;     // 08 R0 memory context 
    DWORD  un1;               // 0C 
    DWORD  TimeOutHandle;     // 10 
    DWORD  WakeParam;         // 14 
    DWORD  BlockHandle;       // 18 R0 semaphore on which thread will wait inside VWIN32 
    DWORD  BlockState;        // 1C 
    DWORD  SuspendCount;      // 20 Number of times SuspendThread() was called 
    DWORD  SuspendHandle;     // 24 
    DWORD  MustCompleteCount; // 28 Count of EnterMustComplete's minus LeaveMustComplete's 
    DWORD  WaitExFlags;       // 2C Flags 
    DWORD  SyncWaitCount;     // 30 
    DWORD  QueuedSyncFuncs;   // 34 
    DWORD  UserAPCList;       // 38 
    DWORD  KernAPCList;       // 3C 
    DWORD  pPMPSPSelector;    // 40 Pointer to protected mode PSP selector 
    DWORD  BlockedOnID;       // 44 
    DWORD  un2[7];            // 48 
    DWORD  TraceRefData;      // 64 
    DWORD  TraceCallBack;     // 68 
    DWORD  TraceEventHandle;  // 6C 
    WORD   TraceOutLastCS;    // 70 
    WORD   K16TDB;            // 72 Win16 TDB selector 
    WORD   K16PDB;            // 74 Win16 PSP selector 
    WORD   DosPDBSeg;         // 76 Real mode segment value of PSP 
    WORD   ExceptionCount;    // 78 
} TDBX95, *PTDBX95;  

typedef struct _TDBX98 { 
    DWORD  un0;                // 00 
    struct _TDB98  *ptdb;              // 04 R3 thread database 
    PDB98  *ppdb;              // 08 R3 process database 
    DWORD  ContextHandle;      // 0C R0 memory context 
    DWORD  Ring0Thread;        // 10 R0 thread control block [TCB *] 
    DWORD  WaitNodeList;       // 14 Anchor of things we're waiting on  [WAITNODE *] 
    DWORD  WaitFlags;          // 18 Blocking flags 
    DWORD  un1;                // 1C 
    DWORD  TimeOutHandle;      // 20 
    DWORD  WakeParam;          // 24 
    DWORD  BlockHandle;        // 28 R0 semaphore on which thread will wait inside VWIN32 
    DWORD  BlockState;         // 2C 
    DWORD  SuspendCount;       // 30 
    DWORD  SuspendHandle;      // 34 
    DWORD  MustCompleteCount;  // 38 Count of EnterMustComplete's minus LeaveMustComplete's 
    DWORD  WaitExFlags;        // 3C Flags 
    DWORD  SyncWaitCount;      // 40 
    DWORD  QueuedSyncFuncs;    // 44 
    DWORD  UserAPCList;        // 48 
    DWORD  KernAPCList;        // 4C 
    DWORD  pPMPSPSelector;     // 50 
    DWORD  BlockedOnID;        // 54 
} TDBX98, *PTDBX98; 

typedef struct _TDBXME {
	DWORD un0;
    DWORD  WaitNodeList;       // Anchor of things we're waiting on  [WAITNODE *] 
    DWORD  WaitFlags;          // Blocking flags 
	DWORD  Ring0Thread;        // R0 thread control block [TCB *] 
	DWORD  ContextHandle;      // R0 memory context 
	PDBME  *ppdb;              // R3 process database
	struct _TDBME  *ptdb;              // R3 thread database
    DWORD  SuspendCount;       //
    DWORD  SuspendHandle;      //
    DWORD  MustCompleteCount;  // Count of EnterMustComplete's minus LeaveMustComplete's
	DWORD  BlockState;         // 
	DWORD  BlockHandle;        // R0 semaphore on which thread will wait inside VWIN32
	DWORD  WakeParam;          //
	DWORD  TimeOutHandle;      //
	DWORD  un1;
	DWORD  unk1;
	DWORD  unk2;
	DWORD  unk3;
	DWORD  unk4;
	DWORD  unk5;
	DWORD  unk6;
	DWORD  unk7;
	DWORD  unk8;
	DWORD  pPMPSPSelector;
	DWORD  KernAPCList;
	DWORD  unk11; // UserAPCList
	DWORD  unk12;
	DWORD  unk13;
	DWORD  WaitExFlags;
} TDBXME, *PTDBXME;

typedef union _TDBX {
	TDBX95 tdbx95;
	TDBX98 tdbx98;
} TDBX, *PTDBX;

typedef struct _SEH 
{ 
    struct _SEH *pNext; 
    FARPROC     pfnHandler; 
} SEH, *PSEH; 
 
// This is semi-documented in the NTDDK.H file from the NT DDK 
typedef struct _TIB95 {         // Size = 0x34 
    PSEH    pvExcept;           // 00 Pointer to head of structured exception handling chain 
    PVOID   pvStackUserTop;     // 04 Max. address for stack 
    PVOID   pvStackUserBase;    // 08 Lowest page aligned addr. of stack 
    WORD    pvTDB;              // 0C Ptr to win-16 task database 
    WORD    pvThunksSS;         // 0E SS selector used for thunking to 16 bits 
    DWORD   SelmanList;         // 10 Pointer to selector manager list 
    PVOID   pvArbitrary;        // 14 Available for application use 
    struct _TIB95 *pTIBSelf;    // 18 Linear address of TIB structure 
    WORD    TIBFlags;           // 1C TIBF_WIN32 = 1, TIBF_TRAP = 2 
    WORD    Win16MutexCount;    // 1E Win16Lock 
    DWORD   DebugContext;       // 20 Pointer to debug context structure 
    DWORD   pCurrentPriority;   // 24 Pointer to DWORD containing current priority level 
    DWORD   pvQueue;            // 28 Message Queue selector 
    PVOID*  pvTLSArray;         // 2C Thread Local Storage (TLS) array 
    PVOID*  pProcess;           // 30 Pointer to owning process database (PDB) 
} TIB95, *PTIB95; 

typedef struct _TIB98 {        // Size = 0x38 
    PSEH    pvExcept;          // 00 Head of exception record list 
    PVOID   pvStackUserTop;    // 04 Top of user stack 
    PVOID   pvStackUserBase;   // 08 Base of user stack 
    WORD    pvTDB;             // 0C Ptr to win-16 task database 
    WORD    pvThunksSS;        // 0E SS selector used for thunking to 16 bits 
    DWORD   SelmanList;        // 10 Pointer to selector manager list 
    PVOID   pvArbitrary;       // 14 Available for application use 
    struct _TIB98 *pTIBSelf;   // 18 Linear address of TIB structure 
    WORD    TIBFlags;          // 1C TIBF_WIN32 = 1, TIBF_TRAP = 2 
    WORD    Win16MutexCount;   // 1E Win16Lock 
    DWORD   DebugContext;      // 20 Pointer to debug context structure 
    DWORD   pCurrentPriority;  // 24 Pointer to DWORD containing current priority level 
    DWORD   pvQueue;           // 28 Message Queue selector 
    PVOID   *pvTLSArray;       // 2C Thread Local Storage (TLS) array 
    PVOID   *pProcess;         // 30 Pointer to owning process database (PDB) 
    DWORD   Unknown;           // 34 Pointer to ??? 
} TIB98, *PTIB98; 

typedef TIB98   TIBME;
typedef TIBME   *PTIBME;

typedef union _TIB {
	TIB95 tib95;
	TIB98 tib98;
	TIBME tibME;
} TIB, *PTIB;

typedef struct _TDB95 {                // Size = 0x1D4 (from Kernel32) 
    DWORD      Type;                   // 00 Object type = K32OBJ_THREAD (6) 
    DWORD      cReference;             // 04 Reference count for thread 
    PPDB95     pProcess;               // 08 Pointer to PDB 
    DWORD      pSomeEvent;             // 0C Pointer to K32OBJ_EVENT 
    TIB95      tib;                    // 10-40 TIB 
    DWORD      Flags;                  // 44 Flags 
    DWORD      TerminationStatus;      // 48 Returned by GetExitCodeThread() 
    WORD       TIBSelector;            // 4C TIB selector 
    WORD       EmulatorSelector;       // 4E 80387 emulator state selector 
    DWORD      cHandles;               // 50 (always 0) 
    DWORD      WaitNodeList;           // 54 Pointer to event list 
    DWORD      un4;                    // 58 (0 or 2) 
    DWORD      Ring0Thread;            // 5C Pointer to ring0 THCB (Thread Control Block) 
    TDBX95     *pTDBX;                 // 60 Pointer to TDBX 
    DWORD      StackBase;              // 64 Lowest stack address 
    DWORD      TerminationStack;       // 68 ESP for thread termination 
    DWORD      EmulatorData;           // 6C Linear address for 80387 emulator data 
    DWORD      GetLastErrorCode;       // 70 Value returned by GetLastErrorCode() 
    DWORD      DebuggerCB;             // 74 Pointer do debugger data 
    DWORD      DebuggerThread;         // 78 If thread is being debugged contains a non-NULL value 
    PCONTEXT   ThreadContext;          // 7C Register context defined in WINNT.H 
    DWORD      Except16List;           // 80 (always 0) 
    DWORD      ThunkConnect;           // 84 (always 0) 
    DWORD      NegStackBase;           // 88 StackBase + NegStackBase 
    DWORD      CurrentSS;              // 8C 16-bit stack selector for thunking 
    DWORD      SSTable;                // 90 Pointer to memory block with 16-bit stack info for thunking 
    DWORD      ThunkSS16;              // 94 Selector for thunking 
    DWORD      TLSArray[64];           // 98 TLS array 
    DWORD      DeltaPriority;          // 198 Diference between priority of thread and priority class of the owning process 
    DWORD      un5[7];                 // 19C 
    DWORD      APISuspendCount;        // 1B8 Number of times SuspendThread() has been called 
    DWORD      un[6];                  // 1BC 
 
/* 
    // The retail version breaks off somewhere around here. 
    // All the remaining fields are most likely only in the debug version 
    DWORD      un5[7];                 // 19C (always 0) 
    DWORD      pCreateData16;          // 1B8 Pointer to struct with PProcessInfo and pStartupInfo (always 0) 
    DWORD      APISuspendCount;        // 1BC Number of times SuspendThread() has been called 
    DWORD      un6;                    // 1C0 
    DWORD      WOWChain;               // 1C4 (always 0) 
    WORD       wSSBig;                 // 1C8 32-bit stack selector (always 0) 
    WORD       un7;                    // 1CA 
    DWORD      lp16SwitchRec;          // 1CC 
    DWORD      un8[6];                 // 1D0 (always 0) 
    DWORD      pSomeCritSect1;         // 1E8 Pointer to K32OBJ_CRITICAL_SECTION 
    DWORD      pWin16Mutex;            // 1EC Pointer to Win16Mutex in KRNL386.EXE 
    DWORD      pWin32Mutex;            // 1F0 Pointer to Krn32Mutex in KERNEL32.DLL 
    DWORD      pSomeCritSect2;         // 1F4 Pointer to K32OBJ_CRITICAL_SECTION 
    DWORD      un9;                    // 1F8 (always 0) 
    DWORD      ripString;              // 1FC 
    DWORD      LastTlsSetValueEIP[64]; // 200 Parallel to TlsArray, contains EIP where TLS value was last set from 
*/ 
} TDB95, *PTDB95;

typedef struct _TDB98 {        // Size = 0x228 (from Kernel32) 
    WORD    Type;              // 00 K32 object type 
    WORD    cReference;        // 02 Reference count 
    DWORD   pSomeEvent;        // 04 K32 event object used when someone waits on the thread object 
    TIB98   tib;               // 08 Thread information block (TIB) 
    DWORD   Unknown;           // 40 
    DWORD   Flags;             // 44 Flags 
    DWORD   TerminationStatus; // 48 Exit code 
    WORD    TIBSelector;       // 4C Selector used in FS to point to TIB 
    WORD    EmulatorSelector;  // 4E Memory block for saving x87 state 
    DWORD   cHandles;          // 50 Handle count 
    DWORD   Ring0Thread;       // 54 R0 thread control block (TCB) 
    TDBX98  *pTDBX;            // 58 R0 thread database extension (TDBX) 
    DWORD   un1[109];          // 5C 
    DWORD   APISuspendCount;   // 210 Count of SuspendThread's minus ResumeThread's 
} TDB98, *PTDB98;

typedef struct _TDBME {        // Size = 0x228 (from Kernel32) 
    WORD    Type;              // 00 K32 object type 
    WORD    cReference;        // 02 Reference count 
    DWORD   pSomeEvent;        // 04 K32 event object used when someone waits on the thread object 
    TIB98   tib;               // 08 Thread information block (TIB) 
    DWORD   Unknown;           // 40 
    DWORD   Unknown2;          // 44 
    WORD    TIBSelector;       // 46 Selector used in FS to point to TIB 
    DWORD   TerminationStatus; // 48 Exit code 
    DWORD   Flags;             // 4C Flags 
    DWORD   cHandles;          // 50 Handle count 
    DWORD   Ring0Thread;       // 54 R0 thread control block (TCB) 
    DWORD   Unknown3;          // 58 Selector for ??? 
    DWORD   un1[109];          // 5C 
    DWORD   APISuspendCount;   // 210 Count of SuspendThread's minus ResumeThread's 
} TDBME, *PTDBME;
 
typedef union _THREAD_DATABASE {
	TDB95 tdb95;
	TDB98 tdb98;
	TDBME tdbME;
} THREAD_DATABASE, *PTHREAD_DATABASE;

typedef struct _K32ObjectHeader95 {
	DWORD dwType;
	DWORD dwRefCnt;
} K32ObjectHeader95, *PK32ObjectHeader95;

typedef struct _K32ObjectHeader98 {
	BYTE dwType;
	BYTE dwFlags;
	WORD dwRefCnt;
} K32ObjectHeader98, *PK32ObjectHeader98;

typedef struct _K32ObjectHeaderME {
	BYTE dwType;
	BYTE dwFlags;
	WORD dwRefCnt;
} K32ObjectHeaderME, *PK32ObjectHeaderME;

typedef struct _K32OBJBASE95 {            
    K32ObjectHeader95   header;         //00 KERNEL32 object header
    BYTE	payload[1];					//08 payload
} K32OBJBASE95, *PK32OBJBASE95; 

typedef struct _K32OBJBASE98 {                 // Size = 0xC4 (from Kernel32) 
    K32ObjectHeader98   header;         //00 KERNEL32 object header
    BYTE	payload[1];					// 04 payload
} K32OBJBASE98, *PK32OBJBASE98; 

typedef struct _K32OBJBASEME {                 // Size = 0xC4 (from Kernel32) 
    K32ObjectHeaderME   header;         //00 KERNEL32 object header
	BYTE	payload[1];					// 04 payload
} K32OBJBASEME, *PK32OBJBASEME; 
 
typedef union _K32OBJBASE {
	K32OBJBASE95 kobj95;
	K32OBJBASE98 kobj98;
	K32OBJBASEME kobjME;
} K32OBJBASE, *PK32OBJBASE;

typedef struct _K32OBJECT_NAME {
	struct _K32OBJECT_NAME *mystery; // -- points to another footer mystery, but doesn't seem to match the previous object created.
	PK32OBJBASE *pSelf;
	BYTE payload[1];
} K32OBJECT_NAME, *PK32OBJECT_NAME;

typedef K32OBJECT_NAME FAR * LPK32OBJECT_NAME;

typedef struct _K32LINKED_LIST_NODE {
	struct _K32LINKED_LIST_NODE FAR * pPrev;
	struct _K32LINKED_LIST_NODE FAR * pNext;
	LPVOID pObj;
} K32LINKED_LIST_NODE, *PK32LINKED_LIST_NODE;

typedef K32LINKED_LIST_NODE FAR * LPK32LINKED_LIST_NODE;

typedef struct _K32OBJ_EVENT95 {
	K32ObjectHeader95 header;
	PPDB95 pPdb; // 08 pdb pointer???
	PSECURITY_ATTRIBUTES pSecurityAttribues; // 0C always NULL for me
	BOOL bInitialState; // 10
	PK32OBJECT_NAME pFooter; // 14
	BOOL bManualReset; // 18
	PVOID mystery2; // 1C
	K32OBJECT_NAME footer; // 20
} K32OBJ_EVENT95, *PK32OBJ_EVENT95;

typedef struct _K32OBJ_EVENT98 {
	K32ObjectHeader98 header;
	PSECURITY_ATTRIBUTES pSecurityAttribues; // 0C always NULL for me
	BOOL bInitialState; // 10
	PK32OBJECT_NAME pFooter; // 14
	DWORD mystery1; // 18
	DWORD mystery2; // 1C
	DWORD mystery3; // 1C
	DWORD mystery4; // 1C
} K32OBJ_EVENT98, *PK32OBJ_EVENT98;

typedef struct _EVENTME {
	K32ObjectHeaderME header;
	PSECURITY_ATTRIBUTES pSecurityAttribues; // 0C always NULL for me
	BOOL bInitialState; // 10
	PK32OBJECT_NAME pFooter; // 14
	DWORD mystery1; // 18
	DWORD mystery2; // 1C
	DWORD mystery3; // 1C
	DWORD mystery4; // 1C
} K32OBJ_EVENTME, *PK32OBJ_EVENTME;

typedef union _K32OBJ_EVENT {
	K32OBJ_EVENT95 event95;
	K32OBJ_EVENT98 event98;
	K32OBJ_EVENTME eventME;
} K32OBJ_EVENT, *PK32OBJ_EVENT;

typedef struct _K32OBJ_FILE_OBJECT_95 {
	K32ObjectHeader95 header;
	PPDB95 pPdb;
	PK32OBJ_EVENT95 pSomeEvent;
	WORD hExtendedFileHandle;
	WORD reserved;
	DWORD dwModeAndFlags; // delete on close = 0xFFFFFFFF, if dos file handle (hExtendedFileHandle <= 0x200) then mode and flags word
	char pszFullPath[1];
} K32OBJ_FILE_OBJECT_95, *PK32OBJ_FILE_OBJECT_95;

typedef struct _K32OBJ_FILE_OBJECT_98 {
	K32ObjectHeader98 header;
	PK32OBJ_EVENT98 pSomeEvent;
	WORD hExtendedFileHandle;
	WORD reserved;
	DWORD dwModeAndFlags; // delete on close = 0xFFFFFFFF, if dos file handle (hExtendedFileHandle <= 0x200) then mode and flags word
	char pszFullPath[1];
} K32OBJ_FILE_OBJECT_98, *PK32OBJ_FILE_OBJECT_98;

typedef struct _K32OBJ_FILE_OBJECT_ME {
	K32ObjectHeaderME header;
	PK32OBJ_EVENTME pSomeEvent;
